[Killed] BlockStatement
application/useCases/helpers/calculateLossFromAvarageGain.ts:1:72
-export default function(avarageGain: number, quantity: number): number {
-    if(avarageGain >= 0){
-        return 0
-    }
-
-    return avarageGain * quantity
-}
+export default function(avarageGain: number, quantity: number): number {}
killedBy: calculateLossFromAvarageGain should return 0 when tha avarage gain is bigger than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
application/useCases/helpers/calculateLossFromAvarageGain.ts:2:25
 export default function(avarageGain: number, quantity: number): number {
-    if(avarageGain >= 0){
-        return 0
-    }
+    if(avarageGain >= 0){}
 
     return avarageGain * quantity
killedBy: calculateLossFromAvarageGain should return 0 when tha avarage gain is bigger than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] EqualityOperator
application/useCases/helpers/calculateLossFromAvarageGain.ts:2:8
 export default function(avarageGain: number, quantity: number): number {
-    if(avarageGain >= 0){
+    if(avarageGain < 0){
         return 0
     }
killedBy: calculateLossFromAvarageGain should return 0 when tha avarage gain is bigger than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] ArithmeticOperator
application/useCases/helpers/calculateLossFromAvarageGain.ts:6:12
         return 0
     }
 
-    return avarageGain * quantity
+    return avarageGain / quantity
 }
killedBy: calculateLossFromAvarageGain should return a value calculated when tha avarage gain is smaller than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -100
Received: -1
