[Killed] BlockStatement
application/useCases/helpers/calculateProfitFromAvarageGain.ts:1:86
-export default function(avarageGain: number, quantity: number, loss: number): number {
-    if(avarageGain < 0){
-        return 0
-    }
-   
-    return (avarageGain * quantity) - loss
-}
+export default function(avarageGain: number, quantity: number, loss: number): number {}
killedBy: calculateProfitFromAvarageGain should return 0 when avarageGain is smaller than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
application/useCases/helpers/calculateProfitFromAvarageGain.ts:2:24
 export default function(avarageGain: number, quantity: number, loss: number): number {
-    if(avarageGain < 0){
-        return 0
-    }
+    if(avarageGain < 0){}
    
     return (avarageGain * quantity) - loss
killedBy: calculateProfitFromAvarageGain should return 0 when avarageGain is smaller than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -100

[Killed] ConditionalExpression
application/useCases/helpers/calculateProfitFromAvarageGain.ts:2:8
 export default function(avarageGain: number, quantity: number, loss: number): number {
-    if(avarageGain < 0){
+    if(true){
         return 0
     }
killedBy: calculateProfitFromAvarageGain should return a calculated value when avarageGain is bigger than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ArithmeticOperator
application/useCases/helpers/calculateProfitFromAvarageGain.ts:6:13
         return 0
     }
    
-    return (avarageGain * quantity) - loss
+    return (avarageGain / quantity) - loss
 }
killedBy: calculateProfitFromAvarageGain should return a calculated value when avarageGain is bigger than zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 1

[Survived] ArithmeticOperator
application/useCases/helpers/calculateProfitFromAvarageGain.ts:6:12
         return 0
     }
    
-    return (avarageGain * quantity) - loss
+    return avarageGain * quantity + loss
 }
