[Killed] BlockStatement
application/useCases/helpers/calculateTaxFromTransaction.ts:7:112
 import calculateLossFromAvarageGain from "./calculateLossFromAvarageGain";
 import transactions from "../../../../config/constants/transactions";
 
-export default function(transaction: any, weightedAvaragePricePaid: number, profit: number, loss:number):taxes {
-    const amount: number = transaction['unit-cost'] * transaction['quantity']
-    const avarageGain: number = transaction['unit-cost'] - weightedAvaragePricePaid;
-    
-    loss += calculateLossFromAvarageGain(avarageGain, transaction['quantity'])
-
-    profit += calculateProfitFromAvarageGain(avarageGain, transaction['quantity'], loss)
-
-    const tax = profit * transactions.TAX_PORCENTAGE;
-    
-    return {
-        tax: verifyIfTheTransactionWillNotPayTaxes(transaction['operation'], transaction['unit-cost'], amount, weightedAvaragePricePaid)  ? 0.0 : tax,
-    }
-
-}
+export default function(transaction: any, weightedAvaragePricePaid: number, profit: number, loss:number):taxes {}
killedBy: calculateTaxFromTransaction should set tax as 0.0 when is not to pay taxes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"tax": 0}
Received: undefined

[Timeout] ArithmeticOperator
application/useCases/helpers/calculateTaxFromTransaction.ts:8:28
 import transactions from "../../../../config/constants/transactions";
 
 export default function(transaction: any, weightedAvaragePricePaid: number, profit: number, loss:number):taxes {
-    const amount: number = transaction['unit-cost'] * transaction['quantity']
+    const amount: number = transaction['unit-cost'] / transaction['quantity']
     const avarageGain: number = transaction['unit-cost'] - weightedAvaragePricePaid;
     

[Timeout] StringLiteral
application/useCases/helpers/calculateTaxFromTransaction.ts:8:40
 import transactions from "../../../../config/constants/transactions";
 
 export default function(transaction: any, weightedAvaragePricePaid: number, profit: number, loss:number):taxes {
-    const amount: number = transaction['unit-cost'] * transaction['quantity']
+    const amount: number = transaction[""] * transaction['quantity']
     const avarageGain: number = transaction['unit-cost'] - weightedAvaragePricePaid;
     

[Killed] ArithmeticOperator
application/useCases/helpers/calculateTaxFromTransaction.ts:9:33
 
 export default function(transaction: any, weightedAvaragePricePaid: number, profit: number, loss:number):taxes {
     const amount: number = transaction['unit-cost'] * transaction['quantity']
-    const avarageGain: number = transaction['unit-cost'] - weightedAvaragePricePaid;
+    const avarageGain: number = transaction['unit-cost'] + weightedAvaragePricePaid;
     
     loss += calculateLossFromAvarageGain(avarageGain, transaction['quantity'])
killedBy: calculateTaxFromTransaction should set tax as calculated value when is to pay taxes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 6.67, 5000, 0
Received
       1: 0, 0, 0
       2: 33.33, 5000, 0

Number of calls: 2

[Killed] ArithmeticOperator
application/useCases/helpers/calculateTaxFromTransaction.ts:15:17
 
     profit += calculateProfitFromAvarageGain(avarageGain, transaction['quantity'], loss)
 
-    const tax = profit * transactions.TAX_PORCENTAGE;
+    const tax = profit / transactions.TAX_PORCENTAGE;
     
     return {
killedBy: calculateTaxFromTransaction should set tax as calculated value when is to pay taxes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "tax": 2,
+   "tax": 50,

[Timeout] StringLiteral
application/useCases/helpers/calculateTaxFromTransaction.ts:18:64
     const tax = profit * transactions.TAX_PORCENTAGE;
     
     return {
-        tax: verifyIfTheTransactionWillNotPayTaxes(transaction['operation'], transaction['unit-cost'], amount, weightedAvaragePricePaid)  ? 0.0 : tax,
+        tax: verifyIfTheTransactionWillNotPayTaxes(transaction[""], transaction['unit-cost'], amount, weightedAvaragePricePaid)  ? 0.0 : tax,
     }
 
