[Killed] BlockStatement
application/useCases/helpers/calculateWeightedAvarageFromList.ts:1:90
-export default function(list: object[], weightIndex: string, valueIndex: string): number {
-    if(weightIndex.length === 0 || valueIndex.length === 0){
-        return 0
-    }
-    let sumOfProduct = 0
-    let qtd = 0
-    list.forEach((item:any) => {
-        sumOfProduct += item[weightIndex] * item[valueIndex]
-        qtd+=item[valueIndex]
-    })
-    const result: number = sumOfProduct/qtd
-
-    return Math.round((result + Number.EPSILON) * 100) / 100
-
-}
+export default function(list: object[], weightIndex: string, valueIndex: string): number {}
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: undefined

[Killed] ConditionalExpression
application/useCases/helpers/calculateWeightedAvarageFromList.ts:2:8
 export default function(list: object[], weightIndex: string, valueIndex: string): number {
-    if(weightIndex.length === 0 || valueIndex.length === 0){
+    if(true){
         return 0
     }
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: 0

[Killed] ConditionalExpression
application/useCases/helpers/calculateWeightedAvarageFromList.ts:2:8
 export default function(list: object[], weightIndex: string, valueIndex: string): number {
-    if(weightIndex.length === 0 || valueIndex.length === 0){
+    if(true || valueIndex.length === 0){
         return 0
     }
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: 0

[Killed] BlockStatement
application/useCases/helpers/calculateWeightedAvarageFromList.ts:7:32
     }
     let sumOfProduct = 0
     let qtd = 0
-    list.forEach((item:any) => {
-        sumOfProduct += item[weightIndex] * item[valueIndex]
-        qtd+=item[valueIndex]
-    })
+    list.forEach((item:any) => {})
     const result: number = sumOfProduct/qtd
 
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: NaN

[Killed] ArithmeticOperator
application/useCases/helpers/calculateWeightedAvarageFromList.ts:8:25
     let sumOfProduct = 0
     let qtd = 0
     list.forEach((item:any) => {
-        sumOfProduct += item[weightIndex] * item[valueIndex]
+        sumOfProduct += item[weightIndex] / item[valueIndex]
         qtd+=item[valueIndex]
     })
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: 0

[Killed] ArithmeticOperator
application/useCases/helpers/calculateWeightedAvarageFromList.ts:11:28
         sumOfProduct += item[weightIndex] * item[valueIndex]
         qtd+=item[valueIndex]
     })
-    const result: number = sumOfProduct/qtd
+    const result: number = sumOfProduct * qtd
 
     return Math.round((result + Number.EPSILON) * 100) / 100
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: 3000000000

[Killed] ArithmeticOperator
application/useCases/helpers/calculateWeightedAvarageFromList.ts:13:23
     })
     const result: number = sumOfProduct/qtd
 
-    return Math.round((result + Number.EPSILON) * 100) / 100
+    return Math.round((result + Number.EPSILON) / 100) / 100
 
 }
killedBy: calculateWeightedAvarageFromList shoul return an weighted avarage value from a list of transactions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 13.33
Received: 0

[Timeout] ArithmeticOperator
application/useCases/helpers/calculateWeightedAvarageFromList.ts:13:12
     })
     const result: number = sumOfProduct/qtd
 
-    return Math.round((result + Number.EPSILON) * 100) / 100
+    return Math.round((result + Number.EPSILON) * 100) * 100
 
 }
