[Timeout] BlockStatement
application/useCases/helpers/verifyIfTheTransactionWillNotPayTaxes.ts:2:117
 import transactions from "../../../../config/constants/transactions";
-export default function(operation: string, unitCost: number, amount: number, weightedAvaregePrice: number): boolean {
-    return operation === 'buy' && (amount < transactions.MAX_AMOUNT_FREE) && unitCost < weightedAvaregePrice
-}
+export default function(operation: string, unitCost: number, amount: number, weightedAvaregePrice: number): boolean {}

[Killed] ConditionalExpression
application/useCases/helpers/verifyIfTheTransactionWillNotPayTaxes.ts:3:12
 import transactions from "../../../../config/constants/transactions";
 export default function(operation: string, unitCost: number, amount: number, weightedAvaregePrice: number): boolean {
-    return operation === 'buy' && (amount < transactions.MAX_AMOUNT_FREE) && unitCost < weightedAvaregePrice
+    return false
 }
killedBy: verifyIfTheTransactionWillNotPayTaxes should return true when transaction is to buy, amount is smaller than 20000 and unit cost is smaller than the weightedAvarageePrice
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
application/useCases/helpers/verifyIfTheTransactionWillNotPayTaxes.ts:3:12
 import transactions from "../../../../config/constants/transactions";
 export default function(operation: string, unitCost: number, amount: number, weightedAvaregePrice: number): boolean {
-    return operation === 'buy' && (amount < transactions.MAX_AMOUNT_FREE) && unitCost < weightedAvaregePrice
+    return false && unitCost < weightedAvaregePrice
 }
killedBy: verifyIfTheTransactionWillNotPayTaxes should return true when transaction is to buy, amount is smaller than 20000 and unit cost is smaller than the weightedAvarageePrice
statusReason: Error: expect(received).toBeTruthy()

Received: false
