[Killed] BlockStatement
main/application/useCases/retrieveTaxFromTransactions.ts:7:65
 import transaction from "../ports/request/transaction";
 
 
-export default function (transactions: transaction[]) : taxes[] {
-    const buyingTransactions:transaction[] = transactions.filter((transaction: transaction) => transaction['operation'] === 'buy')
-    const weightedAvaragePricePaid: number = calculateWeightedAvarageFromList(buyingTransactions, 'unit-cost', 'quantity')
-    return transactions.map((transaction: transaction) => calculateTaxFromTransaction(transaction, weightedAvaragePricePaid, 0, 0))
-    
-}
+export default function (transactions: transaction[]) : taxes[] {}
killedBy: retrieveTaxFromTransactions should return a list of calculated tax from transactions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"tax": 20}, {"tax": 0}]
Received: undefined

[Killed] ConditionalExpression
main/application/useCases/retrieveTaxFromTransactions.ts:8:96
 
 
 export default function (transactions: transaction[]) : taxes[] {
-    const buyingTransactions:transaction[] = transactions.filter((transaction: transaction) => transaction['operation'] === 'buy')
+    const buyingTransactions:transaction[] = transactions.filter((transaction: transaction) => true)
     const weightedAvaragePricePaid: number = calculateWeightedAvarageFromList(buyingTransactions, 'unit-cost', 'quantity')
     return transactions.map((transaction: transaction) => calculateTaxFromTransaction(transaction, weightedAvaragePricePaid, 0, 0))
killedBy: retrieveTaxFromTransactions should return a list of calculated tax from transactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,6 +2,11 @@
    Object {
      "operation": "buy",

[Killed] EqualityOperator
main/application/useCases/retrieveTaxFromTransactions.ts:8:96
 
 
 export default function (transactions: transaction[]) : taxes[] {
-    const buyingTransactions:transaction[] = transactions.filter((transaction: transaction) => transaction['operation'] === 'buy')
+    const buyingTransactions:transaction[] = transactions.filter((transaction: transaction) => transaction['operation'] !== 'buy')
     const weightedAvaragePricePaid: number = calculateWeightedAvarageFromList(buyingTransactions, 'unit-cost', 'quantity')
     return transactions.map((transaction: transaction) => calculateTaxFromTransaction(transaction, weightedAvaragePricePaid, 0, 0))
killedBy: retrieveTaxFromTransactions should return a list of calculated tax from transactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
    Object {
-     "operation": "buy",

[Killed] ArrowFunction
main/application/useCases/retrieveTaxFromTransactions.ts:10:29
 export default function (transactions: transaction[]) : taxes[] {
     const buyingTransactions:transaction[] = transactions.filter((transaction: transaction) => transaction['operation'] === 'buy')
     const weightedAvaragePricePaid: number = calculateWeightedAvarageFromList(buyingTransactions, 'unit-cost', 'quantity')
-    return transactions.map((transaction: transaction) => calculateTaxFromTransaction(transaction, weightedAvaragePricePaid, 0, 0))
+    return transactions.map(() => undefined)
     
 }
killedBy: retrieveTaxFromTransactions should return a list of calculated tax from transactions
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 2

  Array [
-   Object {
-     "tax": 20,
